1. Importing libraries

In [2]:
import pandas as pd 
import numpy as np
import os

2. Importing data

In [4]:
#creating path 

path = r'/Users/emilsafarov/Library/CloudStorage/OneDrive-Personal/CF/A4_Python/Instacart Basket Analysis'

#importing original data sets

#orders data 
df_ords = pd.read_csv(os.path.join(path, '02 Data', 'Original data', 'orders.csv'), index_col = False)

#products data
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Original data', 'products.csv'), index_col = False)

#departments data 
df_dep =  pd.read_csv(os.path.join(path, '02 Data', 'Original data', 'departments.csv'), index_col = False)

3. Wrangling data

3.1. Orders data frame

In [7]:
# checking initial data frame
df_ords.head()

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,prior,1,2,8,NaN
1,2398795,1,prior,2,3,7,15.0
2,473747,1,prior,3,3,12,21.0
3,2254736,1,prior,4,4,7,29.0
4,431534,1,prior,5,4,15,28.0

In [8]:
#droping eval_set column from the data frame 
df_ords=df_ords.drop(columns = ['eval_set'])

#changing data type for order and user id in orders data frame 
df_ords['order_id'] = df_ords['order_id'].astype('str')
df_ords['user_id'] = df_ords['user_id'].astype('str')

#and rechecking data frame after wrangling
df_ords.head()

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0

3.2 Department data frame

In [10]:
#transposing df_dep
df_dep_t=df_dep.T
df_dep_t.head()

                        0
department_id  department
1                  frozen
2                   other
3                  bakery
4                 produce

In [11]:
#changing header of dep df 
# take the first row of df_dep_t for the header
new_header = df_dep_t.iloc[0]
# copying df_dep_t from 1st row onward 
df_dep_t_new = df_dep_t[1:]
# set the header row as df header
df_dep_t_new.columns = new_header
# checking the results and it looks good 
df_dep_t_new.head()

department_id department
1                 frozen
2                  other
3                 bakery
4                produce
5                alcohol

4. Creating data dictionary

In [13]:
data_dict = df_dep_t_new.to_dict('index')
# Checking the results
data_dict

{'1': {'department': 'frozen'},
 '2': {'department': 'other'},
 '3': {'department': 'bakery'},
 '4': {'department': 'produce'},
 '5': {'department': 'alcohol'},
 '6': {'department': 'international'},
 '7': {'department': 'beverages'},
 '8': {'department': 'pets'},
 '9': {'department': 'dry goods pasta'},
 '10': {'department': 'bulk'},
 '11': {'department': 'personal care'},
 '12': {'department': 'meat seafood'},
 '13': {'department': 'pantry'},
 '14': {'department': 'breakfast'},
 '15': {'department': 'canned goods'},
 '16': {'department': 'dairy eggs'},
 '17': {'department': 'household'},
 '18': {'department': 'babies'},
 '19': {'department': 'snacks'},
 '20': {'department': 'deli'},
 '21': {'department': 'missing'}}

5. Task

5.2. Finding an identifier variable in the df_ords DataFrame that doesn’t need to be included in the analysis as a numeric variable and changing it to a suitable format helps ensure accurate data handling.

In [16]:
# checking results 
df_ords.dtypes
# user_id was already converted to a string

order_id                   object
user_id                    object
order_number                int64
order_dow                   int64
order_hour_of_day           int64
days_since_prior_order    float64
dtype: object

5.3. Looking for a variable in the df_ords DataFrame with an unintuitive name and renaming it without overwriting the original DataFrame ensures clarity while preserving the original data structure.

In [18]:
# Rename the 'order_dow' column to 'order_day_of_week' for clarity
df_ords = df_ords.rename(columns={'order_dow': 'order_day_of_week'}, inplace = False )

# Display the modified DataFrame with the new column name
df_ords

,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0
...,...,...,...,...,...,...
3421078,2266710,206209,10,5,18,29.0
3421079,1854736,206209,11,4,10,30.0
3421080,626363,206209,12,1,12,18.0
3421081,2977660,206209,13,1,12,7.0
3421082,272231,206209,14,6,14,30.0

5.4 Analyzing order frequency to identify the busiest hour for placing orders

In [20]:
# Count the occurrences of each unique value in the 'order_hour_of_day' column, including any missing values
df_ords['order_hour_of_day'].value_counts(dropna=False)

order_hour_of_day
10    288418
11    284728
15    283639
14    283042
13    277999
12    272841
16    272553
9     257812
17    228795
18    182912
8     178201
19    140569
20    104292
7      91868
21     78109
22     61468
23     40043
6      30529
0      22758
1      12398
5       9569
2       7539
4       5527
3       5474
Name: count, dtype: int64

Observation: As data described in desc order, it is clear that the busiest hour of the day is 10 am

5.5. Determining the meaning of a value of 4 in the department_id column within the df_prods DataFrame by referencing the data dictionary.

In [23]:
print(data_dict.get('4'))

{'department': 'produce'}

Observation: The value 4 is denoting 'produce' department

5.6. Creating a subset of breakfast item sales to provide the sales team with targeted insights.

In [26]:
# creating subset for breakfast products
df_prods_breakfast = df_prods.loc[df_prods['department_id'] == 14]
# and testing 
df_prods_breakfast.head()

,product_id,product_name,aisle_id,department_id,prices
27,28,Wheat Chex Cereal,121,14,10.1
33,34,NaN,121,14,12.2
67,68,"Pancake Mix, Buttermilk",130,14,13.7
89,90,Smorz Cereal,121,14,3.9
210,211,Gluten Free Organic Cereal Coconut Maple Vanilla,130,14,3.6

5.7. Filtering the DataFrame to include all observations containing items from the alcohol, deli, beverages, and meat/seafood departments

Based on data dictionary the requested products are located at the department under value 5, 7, 12, 20.

In [29]:
# creating a subset for a dinner party 
df_prods_dinner_party = df_prods.loc[df_prods['department_id'].isin([5,7,12,20])]

5.8. Depicting the number of rows with the last created data frame (df_prods_dinner_party).

In [31]:
df_prods_dinner_party.shape

(7650, 5)

5.9. Investigating potential anomalies by extracting all available information for the customer with user_id 1.

In [33]:
df_user1 = df_ords.loc[df_ords['user_id'] == '1']
df_user1.head()

,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0

5.10. Analyzing user behavior by providing basic statistics for the customer with user_id 1, such as order frequency, average order size, most purchased products, and preferred order times.

In [35]:
df_user1.describe()

,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order
count,11.000000,11.000000,11.000000,10.000000
mean,6.000000,2.636364,10.090909,19.000000
std,3.316625,1.286291,3.477198,9.030811
min,1.000000,1.000000,7.000000,0.000000
25%,3.500000,1.500000,7.500000,14.250000
50%,6.000000,3.000000,8.000000,19.500000
75%,8.500000,4.000000,13.000000,26.250000
max,11.000000,4.000000,16.000000,30.000000

6. Expoting data

In [ ]:
#export orders data frame
df_ords.to_csv(os.path.join(path, '02 Data','Prepared Data', 'orders_wrangled_output4_4.csv'))

In [ ]:
#export departments data frame
df_dep_t_new.to_csv(os.path.join(path, '02 Data','Prepared Data', 'departments_wrangled_output4_4.csv'))